//--створити масив з:
//    - з 5 числових значень

//let a = [3, 8, 90, 35, 56];
//console.log(a);

//- з 5 стічкових значень

//let b = ['mother', 'father', 'love', 'like', 'hello'];
//console.log(b);

//- з 5 значень стрічкового, числового та булевого типу

//let c = ['mother', 5, true, 67, 'what'];
//console.log(c);

//- та вивести його в консоль

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

//let a = [];
//a[0] = true;
//a[1] = 687;
//a[2] = 'olololo';
//a[3] = false;
//a[4] = 54;
//a[5] = 'cat';
//console.log(a)

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

//let users = [
//    {name: 'vasya', age: 31, status: false},
//    {name: 'petya', age: 30, status: true},
//    {name: 'kolya', age: 29, status: true},
//    {name: 'olya', age: 28, status: false},
//    {name: 'max', age: 30, status: true},
//    {name: 'anya', age: 31, status: false},
//    {name: 'oleg', age: 28, status: false},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'andrey', age: 29, status: true},
//    {name: 'masha', age: 30, status: true},
//    {name: 'olya', age: 31, status: false},
//    {name: 'olya', age: 31, status: false},
//    {name: 'olya', age: 31, status: false},
//];

//for (const user of users) {
//    document.write(`<div><h3>${user.name} --- ${user.age} --- ${user.status}</h3></div>`)
//}

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

//let i = 0;
//while (i < users.length) {
//    const user = users[i];
//    document.write(`<div><h3>${user.name} --- ${user.age} --- ${user.status}</h3></div>`);
// i++;
//}

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

//let i = 0;
//while (i < users.length) {
//    const user = users[i];
//    document.write(`<div><h1>${user.name} --- ${user.age} --- ${user.status}</h1></div>`);
//    i++;
//}

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

//let i = 0;
//while (i < users.length) {
//    const user = users[i];
//    document.write(`<div><h1>${user.name} --- ${user.age} --- ${user.status}</h1></div>`);
//    i++;
//}

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

//let a = [3, 8, 90, 35, 56, 56, 4.6, 6, 8.9, 10];
//for (const number of a) {
//    console.log(number)
//}

//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

//let b = ['mother', 'father', 'love', 'like', 'hello', 'a', 'hi', 'dog', 'owu', 'good luck'];
//for (const string of b) {
//    console.log(string)
//}

//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

//let c = ['mother', 5, true, 67, 'what', 1, 0, 'hello', false, 'puppy'];
//for (const cElement of c) {
//    console.log(cElement)
//}

//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

//let arr = ['mother', 5, true, 67, 'what', 1, 0, 'hello', false, 'puppy'];
//for (let i = 0; i < arr.length; i++) {
//    const arrElement = arr[i];
//    if (typeof arrElement === "boolean") {
//        console.log(arrElement)
//    }
//}

//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

//let arr = ['mother', 5, true, 67, 'what', 1, 0, 'hello', false, 'puppy'];
//for (let i = 0; i < arr.length; i++) {
//    const arrElement = arr[i];
//    if (typeof arrElement === "number") {
//        console.log(arrElement)
//    }
//}

//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

//let arr = ['mother', 5, true, 67, 'what', 1, 0, 'hello', false, 'puppy'];
//for (let i = 0; i < arr.length; i++) {
//    const arrElement = arr[i];
//    if (typeof arrElement === "string") {
//        console.log(arrElement)
//    }
//}

//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

//let arr = [];
//arr[0] = 'ytyyt';
//arr[1] = 3344;
//arr[2] = 334;
//arr[3] = 'lol';
//arr[4] = true;
//arr[5] = false;
//arr[6] = 'pop';
//arr[7] = 'music';
//arr[8] = 'polo';
//arr[9] = 9979;
//for (const arrElement of arr) {
//    console.log(arrElement)
//}

//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

//for (let i = 0; i < 10; i++) {
//    console.log(i);
//    document.write(i)
//}

//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

//for (let i = 0; i < 100; i++) {
//    console.log(i);
//    document.write(i)
//}

//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

//for (let i = 0; i < 100; i+=2) {
//    console.log(i);
//    document.write(i)
//}

//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

//for (let i = 0; i < 100; i++) {
//    if (i % 2 === 0) {
//        console.log(i);
//        document.write(i)
//    }
//}

//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

//for (let i = 0; i < 100; i++) {
//    if (i % 2 === 1) {
//        console.log(i);
//        document.write(i)
//    }
//}

//- Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

//for (let i = 0; i < 60; i++) {
//    for (let j = 0; j < 60; j++) {
//    console.log(i, j);
//    if (i === 2 && j === 0) {
//        i = 60;
//        break
//    }
//    }
//}

//- Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

//for (let i = 0; i < 24; i++) {
//    for (let j = 0; j < 60; j++) {
//        for (let k = 0; k < 60; k++) {
//            console.log(i, j, k)
//            if (i === 2 && j === 20 && k === 0) {
//                i = 24;
//                j = 60;
//                break
//            }
//        }
//    }
//}

//- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

//let a = ['a', 'b', 'c'];
//for (let i = 1; i < 4; i++) {
//    a.push(i)
//}
//console.log(a)
// ----------------
//let a = ['a', 'b', 'c'];
//for (let i = 1, j = a.length; i < 4; j++, i++) {
//    a[j] = i
//}
//console.log(a)

//- Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

//let a = [1, 2, 3];
//let newArr = [];
//for (let i = a.length - 1, j = 0 ; i >= 0; i--, j++) {
//    newArr[j] = a[i]
//}
//console.log(newArr)

//- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

//let a = [1, 2, 3];
//for (let i = 4, j = a.length; i < 7; j++, i++) {
//    a[j] = i
//}
//console.log(a)

//- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

//let arr = [1, 2, 3];
//for (let i = 6; i > 3; i--) {
//    arr.unshift(i)
//}
//console.log(arr)
//-----------
let arr = [1, 2, 3];
arr.length = 6;
for (let i = arr.length - 1, j = 2; i >= 0, j; i--) {
    arr[i]=arr
}
console.log(arr)

//- Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
//- Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
//- Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//    Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
//- Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//    Підказка. Працюйте по принципу задачі вище.
//- Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


//============

//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//    1. перебрати його циклом while
//    2. перебрати його циклом for
//    3. перебрати циклом while та вивести  числа тільки з непарним індексом
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
//5. перебрати циклом while та вивести  числа тільки парні  значення
//6. перебрати циклом for та вивести  числа тільки парні  значення
//7. замінити кожне число кратне 3 на слово "okten"
//8. вивести масив в зворотньому порядку.
//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//10
//створити пустий масив та :
//    - заповнити його 50 парними числами за допомоги циклу.
//- заповнити його 50 непарними числами за допомоги циклу.


//1. Створити пустий масив та :
//    a. заповнити його 50 парними числами за допомоги циклу.
//    b. заповнити його 50 непарними числами за допомоги циклу.
//    c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
//d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//2. Вивести за допомогою console.log кожен третій елемен
//3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//5. Вивести кожен елемент масиву, сусід справа якого є парним
//EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
//7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.

//______________________________________________________________________________________________________________________________________________________

//- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
//- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
//- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.